// 特殊图表 - 箱线图
export default {
  title: { text: '箱线图 - 数据分布', left: 'center' },
  tooltip: { trigger: 'item' },
  xAxis: {
    type: 'category',
    data: ['实验组1', '实验组2', '实验组3', '实验组4']
  },
  yAxis: { type: 'value' },
  series: [{
    type: 'boxplot',
    data: [
      [850, 740, 900, 1070, 930, 850, 950, 980, 980, 880],
      [960, 940, 960, 940, 880, 800, 850, 880, 900, 840],
      [880, 880, 880, 860, 720, 720, 620, 860, 970, 950],
      [890, 810, 810, 820, 800, 770, 760, 740, 750, 760]
    ]
  }]
}
